; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v11)
             (pred_10 ?v7 ?v10)
             (pred_3 ?v3 ?v10)
             (pred_6 ?v13 ?v3 )
	     (pred_9 ?v3)
             (pred_1 ?v9)
             (pred_12 ?v7)
             (pred_11 ?v10)
             (pred_2 ?v3)
             (pred_7 ?v7)
             (pred_5 ?v3)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v6 ?v12 ?v5)
:precondition (and (pred_1 ?v1) (pred_1 ?v6) (pred_12 ?v12) (pred_11 ?v5)
          (pred_8 ?v1 ?v6) (pred_10 ?v12 ?v5)
                   (pred_3 ?v6 ?v5) (pred_9 ?v1) 
                   (pred_2 ?v6) (pred_7 ?v12))
:effect (and  (pred_5 ?v6) (not (pred_2 ?v6))))


(:action op_1
:parameters (?v1 ?v8)
:precondition (and (pred_1 ?v1) (pred_1 ?v8)
               (pred_9 ?v1) (pred_8 ?v1 ?v8) (pred_5 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v1))))

(:action op_4
:parameters (?v1 ?v12)
:precondition (and (pred_1 ?v1) (pred_12 ?v12) 
                  (pred_9 ?v1) (pred_6 ?v12 ?v1) (pred_4 ))
:effect (and (pred_7 ?v12)
   (not (pred_6 ?v12 ?v1)) (not (pred_4 ))))


(:action op_3
:parameters (?v1 ?v2 ?v4)
:precondition (and (pred_1 ?v1) (pred_12 ?v2) (pred_12 ?v4)
                  (pred_9 ?v1) (pred_7 ?v4) (pred_6 ?v2 ?v1))
:effect (and (pred_7 ?v2) (pred_6 ?v4 ?v1)
        (not (pred_7 ?v4)) (not (pred_6 ?v2 ?v1))))

(:action op_5
:parameters (?v1 ?v12)
:precondition (and (pred_1 ?v1) (pred_12 ?v12) 
                  (pred_9 ?v1) (pred_7 ?v12))
:effect (and (pred_4 ) (pred_6 ?v12 ?v1) (not (pred_7 ?v12)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_31 obj_04 obj_20 obj_28 obj_22 obj_02 obj_10 obj_29 obj_27 obj_16 obj_11 obj_23 obj_08 obj_26 obj_18 obj_13 obj_14 obj_17 obj_09 obj_24 obj_12 obj_19 obj_25 obj_06 obj_01
    obj_03 obj_30 obj_32
    obj_21 obj_05 obj_15 obj_07
    )

    (:init
       (pred_4)

       (pred_1 obj_31)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_28)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_29)
       (pred_1 obj_27)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_23)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_24)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_25)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_30)
       (pred_11 obj_32)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_07)

       (pred_8 obj_31 obj_02)
       (pred_8 obj_31 obj_04)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_31)
       (pred_8 obj_20 obj_29)
       (pred_8 obj_20 obj_28)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_28 obj_27)
       (pred_8 obj_28 obj_22)
       (pred_8 obj_28 obj_20)
       (pred_8 obj_22 obj_16)
       (pred_8 obj_22 obj_28)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_31)
       (pred_8 obj_10 obj_23)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_29 obj_08)
       (pred_8 obj_29 obj_27)
       (pred_8 obj_29 obj_20)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_27 obj_26)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_28)
       (pred_8 obj_27 obj_29)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_22)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_11 obj_23)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_23 obj_14)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_23 obj_10)
       (pred_8 obj_23 obj_11)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_29)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_26 obj_09)
       (pred_8 obj_26 obj_18)
       (pred_8 obj_26 obj_27)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_18 obj_24)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_26)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_11)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_23)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_17 obj_25)
       (pred_8 obj_17 obj_09)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_09 obj_06)
       (pred_8 obj_09 obj_24)
       (pred_8 obj_09 obj_26)
       (pred_8 obj_09 obj_17)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_24 obj_18)
       (pred_8 obj_24 obj_09)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_19 obj_25)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_25 obj_06)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_19)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_09)
       (pred_8 obj_06 obj_25)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_01 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_29)
       (pred_2 obj_26)
       (pred_2 obj_13)
       (pred_3  obj_18 obj_03)
       (pred_3  obj_29 obj_30)
       (pred_3  obj_26 obj_32)
       (pred_3  obj_13 obj_30)
       (pred_5 obj_31)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_22)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_27)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_23)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_24)
       (pred_5 obj_12)
       (pred_5 obj_19)
       (pred_5 obj_25)
       (pred_5 obj_06)
       (pred_5 obj_01)

       (pred_10  obj_21 obj_03)
       (pred_10  obj_05 obj_30)
       (pred_10  obj_15 obj_32)
       (pred_10  obj_07 obj_03)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_07 obj_19)
       (pred_9 obj_19)
    )

    (:goal (and
       (pred_6 obj_15 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_10)))
)
)

; plan
1. (op_1 obj_19 obj_14)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_14)
   goals met: 0 of 1
2. (op_1 obj_14 obj_23)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_23)
   goals met: 0 of 1
3. (op_1 obj_23 obj_11)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_11)
   goals met: 0 of 1
4. (op_1 obj_11 obj_02)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_05)
   deleted: (pred_6 obj_05 obj_02) (pred_4)
   added: (pred_7 obj_05)
   goals met: 0 of 1
6. (op_1 obj_02 obj_11)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_11)
   goals met: 0 of 1
7. (op_5 obj_11 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_4) (pred_6 obj_05 obj_11)
   goals met: 0 of 1
8. (op_1 obj_11 obj_02)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_02)
   goals met: 0 of 1
9. (op_1 obj_02 obj_31)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_31)
   goals met: 0 of 1
10. (op_1 obj_31 obj_04)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_04)
   goals met: 0 of 1
11. (op_1 obj_04 obj_20)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_20)
   goals met: 0 of 1
12. (op_1 obj_20 obj_28)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_28)
   goals met: 0 of 1
13. (op_1 obj_28 obj_22)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_22)
   goals met: 0 of 1
14. (op_1 obj_22 obj_16)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_16)
   goals met: 0 of 1
15. (op_4 obj_16 obj_15)
   deleted: (pred_6 obj_15 obj_16) (pred_4)
   added: (pred_7 obj_15)
   goals met: 0 of 1
16. (op_1 obj_16 obj_27)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_27)
   goals met: 0 of 1
17. (op_2 obj_27 obj_26 obj_15 obj_32)
   deleted: (pred_2 obj_26)
   added: (pred_5 obj_26)
   goals met: 0 of 1
18. (op_1 obj_27 obj_26)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_26)
   goals met: 0 of 1
19. (op_1 obj_26 obj_08)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_08)
   goals met: 0 of 1
20. (op_1 obj_08 obj_23)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_23)
   goals met: 0 of 1
21. (op_1 obj_23 obj_11)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_11)
   goals met: 0 of 1
22. (op_3 obj_11 obj_21 obj_15)
   deleted: (pred_7 obj_15) (pred_6 obj_21 obj_11)
   added: (pred_7 obj_21) (pred_6 obj_15 obj_11)
   goals met: 1 of 1
